Table of Contents
 Enum ShearMethod
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Method of shear calculation
public enum ShearMethod
Fields
MethodJoints = 7
method according 6.2.5(1)
MethodVrdcCracked = 1
method according 6.2.2.1
MethodVrdcGeneralHcs = 4
method according EN1168
MethodVrdcPlain = 5
method according 12.6.3
MethodVrdcPrestress = 2
method according 6.2.2.2
MethodVrdcSimpleHcs = 3
method according 6.2.2.2
MethodVrds = 6
method according 6.2.3.3
NoDefined = 0
not defined
Fields
 Name |  Description
 MethodJoints = 7
method according 6.2.5(1)
 MethodVrdcCracked = 1
method according 6.2.2.1
 MethodVrdcGeneralHcs = 4
method according EN1168
 MethodVrdcPlain = 5
method according 12.6.3
 MethodVrdcPrestress = 2
method according 6.2.2.2
 MethodVrdcSimpleHcs = 3
method according 6.2.2.2
 MethodVrds = 6
method according 6.2.3.3
 NoDefined = 0
not defined
 Edit this page